#Задачи:



#1. Создайте две переменные (a=10, b=30). Выведите на экран результат математического взаимодействия (+, -, *, / ) этих чисел.
a=10
b=30
print(a+b)
print(a-b)
print(a/b)
print(a*b)

#2. Создайте переменную и запишите в нее результат сравнения (<, > , ==, !=) переменных a и b.
# После этого выведите # с помощью print() на экран значение полученной переменной для каждого случая.

x = a < b
print(x)
x = a > b
print(x)
x = a == b
print(x)
x = a != b
print(x)
#3. Создать переменную и запишите в нее результат конкатенации (сложения) строк str1="Hello " и str2="world". Выведите ее на экран.
str = "Hello" + " " + "world"
print(str)
#4* Создайте переменную new_string = "Hello world!"
# . Сохраните в переменную str_len длину строки из переменной new_string и выведите ее на экран
new_string = "Hello world!"
str_len = len(new_string)
print(str_len)